RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* SHRTIMER_MTDMAINTEN */
#define SHRTIMER_MTDMAINTEN_CMP0IE                       BIT(0)              /*!< compare 0 interrupt enable */
#define SHRTIMER_MTDMAINTEN_CMP1IE                       BIT(1)              /*!< compare 1 interrupt enable */
#define SHRTIMER_MTDMAINTEN_CMP2IE                       BIT(2)              /*!< compare 2 interrupt enable */
#define SHRTIMER_MTDMAINTEN_CMP3IE                       BIT(3)              /*!< compare 3 interrupt enable */
#define SHRTIMER_MTDMAINTEN_REPIE                        BIT(4)              /*!< repetition interrupt enable */
#define SHRTIMER_MTDMAINTEN_SYNIIE                       BIT(5)              /*!< synchronization input interrupt enable */
#define SHRTIMER_MTDMAINTEN_UPIE                         BIT(6)              /*!< update interrupt enable */
#define SHRTIMER_MTDMAINTEN_CMP0DEN                      BIT(16)             /*!< compare 0 DMA request enable */
#define SHRTIMER_MTDMAINTEN_CMP1DEN                      BIT(17)             /*!< compare 1 DMA request enable */
#define SHRTIMER_MTDMAINTEN_CMP2DEN                      BIT(18)             /*!< compare 2 DMA request enable */
#define SHRTIMER_MTDMAINTEN_CMP3DEN                      BIT(19)             /*!< compare 3 DMA request enable */
#define SHRTIMER_MTDMAINTEN_REPDEN                       BIT(20)             /*!< repetition DMA request enable */
#define SHRTIMER_MTDMAINTEN_SYNIDEN                      BIT(21)             /*!< synchronization input DMA request enable */
#define SHRTIMER_MTDMAINTEN_UPDEN                        BIT(22)             /*!< update DMA request enable */

/* SHRTIMER_MTCNT */
#define SHRTIMER_MTCNT_CNT                               BITS(0,15)          /*!< the current counter value */

/* SHRTIMER_MTCAR */
#define SHRTIMER_MTCAR_CARL                              BITS(0,15)          /*!< counter auto reload value */

/* SHRTIMER_MTCREP */
#define SHRTIMER_MTCREP_CREP                             BITS(0,7)           /*!< counter repetition value */

/* SHRTIMER_MTCMP0V */
#define SHRTIMER_MTCMP0V_CMP0VAL                         BITS(0,15)          /*!< compare 0 value */

/* SHRTIMER_MTCMP1V */
#define SHRTIMER_MTCMP1V_CMP1VAL                         BITS(0,15)          /*!< compare 1 value */

/* SHRTIMER_MTCMP2V */
#define SHRTIMER_MTCMP2V_CMP0VAL                         BITS(0,15)          /*!< compare 2 value */

/* SHRTIMER_MTCMP3V */
#define SHRTIMER_MTCMP3V_CMP0VAL                         BITS(0,15)          /*!< compare 3 value */

/* SHRTIMER_MTACTL */
#define SHRTIMER_MTACTL_CNTCKDIV3                        BIT(3)              /*!< counter clock division */

/* Slave_TIMERx registers(x=0..4) */
/* SHRTIMER_STxCTL0 */
#define SHRTIMER_STXCTL0_CNTCKDIV2_0                     BITS(0,2)           /*!< counter clock division */
#define SHRTIMER_STXCTL0_CTNM                            BIT(3)              /*!< continuous mode */
#define SHRTIMER_STXCTL0_CNTRSTM                         BIT(4)              /*!< counter reset mode */
#define SHRTIMER_STXCTL0_HALFM                           BIT(5)              /*!< half mode */
#define SHRTIMER_STXCTL0_BLNMEN                          BIT(6)              /*!< balanced mode enable */
#define SHRTIMER_STXCTL0_SYNIRST                         BIT(10)             /*!< synchronization input reset counter */
#define SHRTIMER_STXCTL0_SYNISTRT                        BIT(11)             /*!< synchronization input start counter */
#define SHRTIMER_STXCTL0_DELCMP1M                        BITS(12,13)         /*!< compare 1 delayed mode */
#define SHRTIMER_STXCTL0_DELCMP3M                        BITS(14,15)         /*!< compare 3 delayed mode */
#define SHRTIMER_STXCTL0_UPREP                           BIT(17)             /*!< update event generated by repetition event */
#define SHRTIMER_STXCTL0_UPRST                           BIT(18)             /*!< update event generated by reset event */
#define SHRTIMER_STXCTL0_UPBST0                          BIT(19)             /*!< update by Slave_TIMER0 update event */
#define SHRTIMER_STXCTL0_UPBST1                          BIT(20)             /*!< update by Slave_TIMER1 update event */
#define SHRTIMER_STXCTL0_UPBST2                          BIT(21)             /*!< update by Slave_TIMER2 update event */
#define SHRTIMER_STXCTL0_UPBST3                          BIT(22)             /*!< update by Slave_TIMER3 update event */
#define SHRTIMER_STXCTL0_UPBST4                          BIT(23)             /*!< update by Slave_TIMER4 update event */
#define SHRTIMER_STXCTL0_UPBMT                           BIT(24)             /*!< update by Master_TIMER update event */
#define SHRTIMER_STXCTL0_DACTRGS                         BITS(25,26)         /*!< trigger source to DAC */
#define SHRTIMER_STXCTL0_SHWEN                           BIT(27)             /*!< shadow registers enable */
#define SHRTIMER_STXCTL0_UPSEL                           BITS(28,31)         /*!< update event selection */

/* SHRTIMER_STxINTF */
#define SHRTIMER_STXINTF_CMP0IF                          BIT(0)              /*!< compare 0 interrupt flag */
#define SHRTIMER_STXINTF_CMP1IF                          BIT(1)              /*!< compare 1 interrupt flag */
#define SHRTIMER_STXINTF_CMP2IF                          BIT(2)              /*!< compare 2 interrupt flag */
#define SHRTIMER_STXINTF_CMP3IF                          BIT(3)              /*!< compare 3 interrupt flag */
#define SHRTIMER_STXINTF_REPIF                           BIT(4)              /*!< repetition interrupt flag */
#define SHRTIMER_STXINTF_UPIF                            BIT(6)              /*!< update interrupt flag */
#define SHRTIMER_STXINTF_CAP0IF                          BIT(7)              /*!< capture 0 interrupt flag */
#define SHRTIMER_STXINTF_CAP1IF                          BIT(8)              /*!< capture 1 interrupt flag */
#define SHRTIMER_STXINTF_CH0OAIF                         BIT(9)              /*!< channel 0 output active interrupt flag */
#define SHRTIMER_STXINTF_CH0ONAIF                        BIT(10)             /*!< channel 0 output inactive interrupt flag */
#define SHRTIMER_STXINTF_CH1OAIF                         BIT(11)             /*!< channel 1 output active interrupt flag */
#define SHRTIMER_STXINTF_CH1ONAIF                        BIT(12)             /*!< channel 1 output inactive interrupt flag */
#define SHRTIMER_STXINTF_RSTIF                           BIT(13)             /*!< counter reset interrupt flag */
#define SHRTIMER_STXINTF_DLYIIF                          BIT(14)             /*!< delayed IDLE mode entry interrupt flag */
#define SHRTIMER_STXINTF_CBLNF                           BIT(16)             /*!< current balanced flag */
#define SHRTIMER_STXINTF_BLNIF                           BIT(17)             /*!< balanced IDLE flag */
#define SHRTIMER_STXINTF_CH0F                            BIT(20)             /*!< channel 0 output flag */
#define SHRTIMER_STXINTF_CH1F                            BIT(21)             /*!< channel 1 output flag */

/* SHRTIMER_STxINTC */
#define SHRTIMER_STXINTC_CMP0IFC                         BIT(0)              /*!< clear compare 0 interrupt flag */
#define SHRTIMER_STXINTC_CMP1IFC                         BIT(1)              /*!< clear compare 1 interrupt flag */
#define SHRTIMER_STXINTC_CMP2IFC                         BIT(2)              /*!< clear compare 2 interrupt flag */
#define SHRTIMER_STXINTC_CMP3IFC                         BIT(3)              /*!< clear compare 3 interrupt flag */
#define SHRTIMER_STXINTC_REPIFC                          BIT(4)              /*!< clear repetition interrupt flag */
#define SHRTIMER_STXINTC_UPIFC                           BIT(6)              /*!< clear update interrupt flag */
#define SHRTIMER_STXINTC_CAP0IFC                         BIT(7)              /*!< clear capture 0 interrupt flag */
#define SHRTIMER_STXINTC_CAP1IFC                         BIT(8)              /*!< clear capture 1 interrupt flag */
#define SHRTIMER_STXINTC_CH0OAIFC                        BIT(9)              /*!< clear channel 0 output active interrupt flag */
#define SHRTIMER_STXINTC_CH0ONAIFC                       BIT(10)             /*!< clear channel 0 output inactive interrupt flag */
#define SHRTIMER_STXINTC_CH1OAIFC                        BIT(11)             /*!< clear channel 1 output active interrupt flag */
#define SHRTIMER_STXINTC_CH1ONAIFC                       BIT(12)             /*!< clear channel 1 output inactive interrupt flag */
#define SHRTIMER_STXINTC_RSTIFC                          BIT(13)             /*!< clear counter reset interrupt flag */
#define SHRTIMER_STXINTC_DLYIIFC                         BIT(14)             /*!< clear delayed IDLE mode entry interrupt flag */

