RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* SHRTIMER_STxCAP0TRG */
#define SHRTIMER_STXCAP0TRG_CP0BSW                       BIT(0)              /*!< capture 0 triggered by software */
#define SHRTIMER_STXCAP0TRG_CP0BUP                       BIT(1)              /*!< capture 0 triggered by update event */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV0                    BIT(2)              /*!< capture 0 triggered by external event 0 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV1                    BIT(3)              /*!< capture 0 triggered by external event 1 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV2                    BIT(4)              /*!< capture 0 triggered by external event 2 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV3                    BIT(5)              /*!< capture 0 triggered by external event 3 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV4                    BIT(6)              /*!< capture 0 triggered by external event 4 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV5                    BIT(7)              /*!< capture 0 triggered by external event 5 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV6                    BIT(8)              /*!< capture 0 triggered by external event 6 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV7                    BIT(9)              /*!< capture 0 triggered by external event 7 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV8                    BIT(10)             /*!< capture 0 triggered by external event 8 */
#define SHRTIMER_STXCAP0TRG_CP0BEXEV9                    BIT(11)             /*!< capture 0 triggered by external event 9 */
#define SHRTIMER_STXCAP0TRG_CP0BST0A                     BIT(12)             /*!< capture 0 triggered by ST0CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP0TRG_CP0BST0NA                    BIT(13)             /*!< capture 0 triggered by ST0CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP0TRG_CP0BST0CMP0                  BIT(14)             /*!< capture 0 triggered by compare 0 event of Slave_TIMER0  */
#define SHRTIMER_STXCAP0TRG_CP0BST0CMP1                  BIT(15)             /*!< capture 0 triggered by compare 1 event of Slave_TIMER0 */
#define SHRTIMER_STXCAP0TRG_CP0BST1A                     BIT(16)             /*!< capture 0 triggered by ST1CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP0TRG_CP0BST1NA                    BIT(17)             /*!< capture 0 triggered by ST1CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP0TRG_CP0BST1CMP0                  BIT(18)             /*!< capture 0 triggered by compare 0 event of Slave_TIMER1 */
#define SHRTIMER_STXCAP0TRG_CP0BST1CMP1                  BIT(19)             /*!< capture 0 triggered by compare 1 event of Slave_TIMER1 */
#define SHRTIMER_STXCAP0TRG_CP0BST2A                     BIT(20)             /*!< capture 0 triggered by ST2CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP0TRG_CP0BST2NA                    BIT(21)             /*!< capture 0 triggered by ST2CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP0TRG_CP0BST2CMP0                  BIT(22)             /*!< capture 0 triggered by compare 0 event of Slave_TIMER2 */
#define SHRTIMER_STXCAP0TRG_CP0BST2CMP1                  BIT(23)             /*!< capture 0 triggered by compare 1 event of Slave_TIMER2 */
#define SHRTIMER_STXCAP0TRG_CP0BST3A                     BIT(24)             /*!< capture 0 triggered by ST3CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP0TRG_CP0BST3NA                    BIT(25)             /*!< capture 0 triggered by ST3CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP0TRG_CP0BST3CMP0                  BIT(26)             /*!< capture 0 triggered by compare 0 event of Slave_TIMER3 */
#define SHRTIMER_STXCAP0TRG_CP0BST3CMP1                  BIT(27)             /*!< capture 0 triggered by compare 1 event of Slave_TIMER3 */
#define SHRTIMER_STXCAP0TRG_CP0BST4A                     BIT(28)             /*!< capture 0 triggered by ST4CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP0TRG_CP0BST4NA                    BIT(29)             /*!< capture 0 triggered by ST4CH0_O output active to inactive transition. */
#define SHRTIMER_STXCAP0TRG_CP0BST4CMP0                  BIT(30)             /*!< capture 0 triggered by compare 0 event of Slave_TIMER4 */
#define SHRTIMER_STXCAP0TRG_CP0BST4CMP1                  BIT(31)             /*!< capture 0 triggered by compare 1 event of Slave_TIMER4 */

/* SHRTIMER_STxCAP1TRG */
#define SHRTIMER_STXCAP1TRG_CP1BSW                       BIT(0)              /*!< capture 1 triggered by software */
#define SHRTIMER_STXCAP1TRG_CP1BUP                       BIT(1)              /*!< capture 1 triggered by update event */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV0                    BIT(2)              /*!< capture 1 triggered by external event 0 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV1                    BIT(3)              /*!< capture 1 triggered by external event 1 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV2                    BIT(4)              /*!< capture 1 triggered by external event 2 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV3                    BIT(5)              /*!< capture 1 triggered by external event 3 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV4                    BIT(6)              /*!< capture 1 triggered by external event 4 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV5                    BIT(7)              /*!< capture 1 triggered by external event 5 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV6                    BIT(8)              /*!< capture 1 triggered by external event 6 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV7                    BIT(9)              /*!< capture 1 triggered by external event 7 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV8                    BIT(10)             /*!< capture 1 triggered by external event 8 */
#define SHRTIMER_STXCAP1TRG_CP1BEXEV9                    BIT(11)             /*!< capture 1 triggered by external event 9 */
#define SHRTIMER_STXCAP1TRG_CP1BST0A                     BIT(12)             /*!< capture 1 triggered by ST0CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP1TRG_CP1BST0NA                    BIT(13)             /*!< capture 1 triggered by ST0CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP1TRG_CP1BST0CMP0                  BIT(14)             /*!< capture 1 triggered by compare 0 event of Slave_TIMER0  */
#define SHRTIMER_STXCAP1TRG_CP1BST0CMP1                  BIT(15)             /*!< capture 1 triggered by compare 1 event of Slave_TIMER0 */
#define SHRTIMER_STXCAP1TRG_CP1BST1A                     BIT(16)             /*!< capture 1 triggered by ST1CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP1TRG_CP1BST1NA                    BIT(17)             /*!< capture 1 triggered by ST1CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP1TRG_CP1BST1CMP0                  BIT(18)             /*!< capture 1 triggered by compare 0 event of Slave_TIMER1 */
#define SHRTIMER_STXCAP1TRG_CP1BST1CMP1                  BIT(19)             /*!< capture 1 triggered by compare 1 event of Slave_TIMER1 */
#define SHRTIMER_STXCAP1TRG_CP1BST2A                     BIT(20)             /*!< capture 1 triggered by ST2CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP1TRG_CP1BST2NA                    BIT(21)             /*!< capture 1 triggered by ST2CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP1TRG_CP1BST2CMP0                  BIT(22)             /*!< capture 1 triggered by compare 0 event of Slave_TIMER2 */
#define SHRTIMER_STXCAP1TRG_CP1BST2CMP1                  BIT(23)             /*!< capture 1 triggered by compare 1 event of Slave_TIMER2 */
#define SHRTIMER_STXCAP1TRG_CP1BST3A                     BIT(24)             /*!< capture 1 triggered by ST3CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP1TRG_CP1BST3NA                    BIT(25)             /*!< capture 1 triggered by ST3CH0_O output active to inactive transition */
#define SHRTIMER_STXCAP1TRG_CP1BST3CMP0                  BIT(26)             /*!< capture 1 triggered by compare 0 event of Slave_TIMER3 */
#define SHRTIMER_STXCAP1TRG_CP1BST3CMP1                  BIT(27)             /*!< capture 1 triggered by compare 1 event of Slave_TIMER3 */
#define SHRTIMER_STXCAP1TRG_CP1BST4A                     BIT(28)             /*!< capture 1 triggered by ST4CH0_O output inactive to active transition */
#define SHRTIMER_STXCAP1TRG_CP1BST4NA                    BIT(29)             /*!< capture 1 triggered by ST4CH0_O output active to inactive transition. */
#define SHRTIMER_STXCAP1TRG_CP1BST4CMP0                  BIT(30)             /*!< capture 1 triggered by compare 0 event of Slave_TIMER4 */
#define SHRTIMER_STXCAP1TRG_CP1BST4CMP1                  BIT(31)             /*!< capture 1 triggered by compare 1 event of Slave_TIMER4 */

/* SHRTIMER_STxCHOCTL */
#define SHRTIMER_STXCHOCTL_CH0P                          BIT(1)              /*!< channel 0 output polarity */
#define SHRTIMER_STXCHOCTL_BMCH0IEN                      BIT(2)              /*!< channel 0 IDLE state enable in bunch mode */
#define SHRTIMER_STXCHOCTL_ISO0                          BIT(3)              /*!< channel 0 output idle state */
#define SHRTIMER_STXCHOCTL_CH0FLTOS                      BITS(4,5)           /*!< channel 0 fault output state */
#define SHRTIMER_STXCHOCTL_CH0CSEN                       BIT(6)              /*!< channel 0 carrier-signal mode enable */
#define SHRTIMER_STXCHOCTL_BMCH0DTI                      BIT(7)              /*!< channel 0 dead-time insert in bunch mode */
#define SHRTIMER_STXCHOCTL_DTEN                          BIT(8)              /*!< dead time enable */
#define SHRTIMER_STXCHOCTL_DLYISMEN                      BIT(9)              /*!< delayed IDLE state mode enable */
#define SHRTIMER_STXCHOCTL_DLYISCH                       BITS(10,12)         /*!< delayed IDLE source and channel */
#define SHRTIMER_STXCHOCTL_CH1P                          BIT(17)             /*!< channel 1 output polarity */
#define SHRTIMER_STXCHOCTL_BMCH1IEN                      BIT(18)             /*!< channel 1 IDLE state enable in bunch mode */
#define SHRTIMER_STXCHOCTL_ISO1                          BIT(19)             /*!< channel 1 output idle state */
#define SHRTIMER_STXCHOCTL_CH1FLTOS                      BITS(20,21)         /*!< channel 1 fault output state */
#define SHRTIMER_STXCHOCTL_CH1CSEN                       BIT(22)             /*!< channel 1 carrier-signal mode enable */
#define SHRTIMER_STXCHOCTL_BMCH1DTI                      BIT(23)             /*!< channel 1 dead-time insert in bunch mode */

