RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* SHRTIMER_FLTINCFG1 */
#define SHRTIMER_FLTINCFG1_FLT4INEN                      BIT(0)              /*!< fault 4 input enable */
#define SHRTIMER_FLTINCFG1_FLT4INP                       BIT(1)              /*!< fault 4 input polarity */
#define SHRTIMER_FLTINCFG1_FLT4INSRC                     BIT(2)              /*!< fault 4 input source */
#define SHRTIMER_FLTINCFG1_FLT4INFC                      BITS(3,6)           /*!< fault 4 input filter control */
#define SHRTIMER_FLTINCFG1_FLT4INPROT                    BIT(7)              /*!< protect fault 4 input configuration */
#define SHRTIMER_FLTINCFG1_FLTFDIV                       BITS(24,25)         /*!< fault input digital filter clock division */

/* SHRTIMER_DMAUPMTR */
#define SHRTIMER_DMAUPMTR_MTCTL0                         BIT(0)              /*!< SHRTIMER_MTCTL0 update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTINTC                         BIT(1)              /*!< SHRTIMER_MTINTC update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTDMAINTEN                     BIT(2)              /*!< SHRTIMER_MTDMAINTEN update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCNT                          BIT(3)              /*!< SHRTIMER_MTCNT update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCAR                          BIT(4)              /*!< SHRTIMER_MTCAR update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCREP                         BIT(5)              /*!< SHRTIMER_MTCREP update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCMP0V                        BIT(6)              /*!< SHRTIMER_MTCMP0V update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCMP1V                        BIT(7)              /*!< SHRTIMER_MTCMP1V update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCMP2V                        BIT(8)              /*!< SHRTIMER_MTCMP2V update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTCMP3V                        BIT(9)              /*!< SHRTIMER_MTCMP3V update by DMA mode */
#define SHRTIMER_DMAUPMTR_MTACTL                         BIT(31)             /*!< SHRTIMER_MTACTL update by DMA mode */

/* SHRTIMER_DMAUPSTxR */
#define SHRTIMER_DMAUPSTXR_STXCTL0                       BIT(0)              /*!< SHRTIMER_STxCTL0 update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXINTC                       BIT(1)              /*!< SHRTIMER_STxINTC update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXDMAINTEN                   BIT(2)              /*!< SHRTIMER_STxDMAINTEN update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCNT                        BIT(3)              /*!< SHRTIMER_STxCNT update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCAR                        BIT(4)              /*!< SHRTIMER_STxCAR update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCREP                       BIT(5)              /*!< SHRTIMER_STxCREP update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCMP0V                      BIT(6)              /*!< SHRTIMER_STxCMP0V update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCMP1V                      BIT(7)              /*!< SHRTIMER_STxCMP1V update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCMP2V                      BIT(8)              /*!< SHRTIMER_STxCMP2V update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCMP3V                      BIT(9)              /*!< SHRTIMER_STxCMP3V update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXDTCTL                      BIT(10)             /*!< SHRTIMER_STxDTCTL update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCH0SET                     BIT(11)             /*!< SHRTIMER_STxCH0SET update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCH0RST                     BIT(12)             /*!< SHRTIMER_STxCH0RST update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCH1SET                     BIT(13)             /*!< SHRTIMER_STxCH1SET update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCH1RST                     BIT(14)             /*!< SHRTIMER_STxCH1RST update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXEXEVFCFG0                  BIT(15)             /*!< SHRTIMER_STxEXEVFCFG0 update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXEXEVFCFG1                  BIT(16)             /*!< SHRTIMER_STxEXEVFCFG1 update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCNTRST                     BIT(17)             /*!< SHRTIMER_STxCNTRST update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCSCTL                      BIT(18)             /*!< SHRTIMER_STxCSCTL update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXCHOCTL                     BIT(19)             /*!< SHRTIMER_STxCHOCTL update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXFLTCTL                     BIT(20)             /*!< SHRTIMER_STxFLTCTL update by DMA mode */
#define SHRTIMER_DMAUPSTXR_STXACTL                       BIT(31)             /*!< SHRTIMER_STxACTL update by DMA mode */

/* SHRTIMER_DMATB */
#define SHRTIMER_DMATB_DMATB                             BITS(0,31)          /*!< DMA transfer buffer */

/* constants definitions */
/* SHRTIMER time base parameters struct definitions */
typedef struct
{
    uint32_t period;                            /*!< period value, min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF �C (1*tSHRTIMER_CK) */
    uint32_t repetitioncounter;                 /*!< the counter repetition value, 0x00~0xFF */
    uint32_t prescaler;                         /*!< prescaler value, refer to: counter clock division */
    uint32_t counter_mode;                      /*!< counter operating mode, refer to: counter operating mode */
}shrtimer_baseinit_parameter_struct;

/* waveform mode initialization parameters struct definitions */
typedef struct {
    uint32_t half_mode;                         /*!< specifies whether or not half mode is enabled, refer to: half mode enabling status */
    uint32_t start_sync;                        /*!< specifies whether or not timer is started by a rising edge on the synchronization input, refer to: synchronous input start timer */
    uint32_t reset_sync;                        /*!< specifies whether or not timer is reset by a rising edge on the synchronization input, refer to: synchronous input reset timer */
    uint32_t dac_trigger;                       /*!< indicates whether or not the a DAC synchronization event is generated, refer to: trigger source to DAC */
    uint32_t shadow;                            /*!< specifies whether or not the shadow registers are enabled, refer to: shadow registers enabling status */
    uint32_t update_selection;                  /*!< the update occurs with respect to DMA mode or STxUPINy (Slave_TIMERx only), refer to: update event selection */
    uint32_t cnt_bunch;                         /*!< the timer behaves during a bunch mode operation, refer to: timer behaves during a bunch mode operation */
    uint32_t repetition_update;                 /*!< specifies whether or not registers update is triggered by the repetition event, refer to: update event generated by repetition event */
}shrtimer_timerinit_parameter_struct;

/* Slave_TIMER general behavior configuration struct definitions */
typedef struct {
    uint32_t balanced_mode;                     /*!< specifies whether or not the balanced mode is enabled, refer to: set balanced mode */
    uint32_t fault_enable;                      /*!< specifies whether or not the fault channels are enabled for the Slave_TIMER, refer to: faut channel enabled for a Slave_TIMER*/
    uint32_t fault_protect ;                    /*!< specifies whether the write protection function is enable or not, refer to: protect fault enable */
    uint32_t deadtime_enable;                   /*!< specifies whether or not dead time insertion is enabled for the timer, refer to: dead time enable */
    uint32_t delayed_idle;                      /*!< the delayed IDLE mode, refer to: set delayed IDLE state mode */
    uint32_t update_source;                     /*!< the source triggering the Slave_TIMER registers update, refer to: update is done synchronously with any other Slave_TIMER or Master_TIMER update */
    uint32_t cnt_reset;                         /*!< the source triggering the Slave_TIMER counter reset, refer to: Slave_TIMER counter reset */
    uint32_t reset_update;                      /*!< specifies whether or not registers update is triggered when the timer counter is reset, refer to: update event generated by reset event */
}shrtimer_timercfg_parameter_struct;

/* compare unit configuration struct definitions */
typedef struct {
    uint32_t compare_value;                     /*!< compare value, min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF �C (1*tSHRTIMER_CK) */
    uint32_t delayed_mode;                      /*!< defining whether the compare register is behaving in regular mode or in delayed mode, refer to: compare 3 or 1 delayed mode */
    uint32_t timeout_value;                     /*!< compare value for compare 0 or 2 when compare 3 or 1 is delayed mode with time out is selected , timeout_value + compare_value must be less than 0xFFFF */
}shrtimer_comparecfg_parameter_struct;

