RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* external event filtering for Slave_TIMER configuration struct definitions */
typedef struct {
    uint32_t filter_mode;                       /*!< the external event filter mode for Slave_TIMER, refer to: external event filter mode */
    uint32_t memorized;                         /*!< specifies whether or not the signal is memorized, refer to: external event memorized enable */
}shrtimer_exevfilter_parameter_struct;

/* dead time configuration struct definitions */
typedef struct {
    uint32_t prescaler;                         /*!< dead time generator clock division, refer to: dead time prescaler */
    uint32_t rising_value;                      /*!< rising edge dead-time value, 0x0000~0xFFFF */
    uint32_t rising_sign;                       /*!< the sign of rising edge dead-time value, refer to: dead time rising sign */
    uint32_t rising_protect;                    /*!< dead time rising edge protection for value and sign, refer to: dead time rising edge protection for value and sign */
    uint32_t risingsign_protect;                /*!< dead time rising edge protection for sign, refer to: dead time rising edge protection only for sign */
    uint32_t falling_value;                     /*!< falling edge dead-time value, 0x0000~0xFFFF */
    uint32_t falling_sign;                      /*!< the sign of falling edge dead-time value, refer to: dead time falling sign */
    uint32_t falling_protect;                   /*!< dead time falling edge protection for value and sign, refer to: dead time falling edge protection for value and sign */
    uint32_t fallingsign_protect;               /*!< dead time falling edge protection for sign, refer to: dead time falling edge protection only for sign */
}shrtimer_deadtimecfg_parameter_struct;

/* carrier signal configuration struct definitions */
typedef struct {
    uint32_t period;                            /*!< carrier signal period: tCSPRD, 0x0~0xF. tCSPRD = (period + 1) * 16 * tSHRTIMER_CK */
    uint32_t duty_cycle;                        /*!< carrier signal duty cycle, 0x0~0x7, duty cycle = duty_cycle/8 */
    uint32_t first_pulse;                       /*!< first carrier-signal pulse width: tCSFSTPW, 0x0~0xF. tCSFSTPW = (first_pulse+1) * 16 * tSHRTIMER_CK */
}shrtimer_carriersignalcfg_parameter_struct;

/* synchronization configuration struct definitions */
typedef struct {
    uint32_t input_source;                      /*!< the external synchronization input source, refer to: the synchronization input source */
    uint32_t output_source;                     /*!< the source and event to be sent on the external synchronization outputs, refer to: the synchronization output source */
    uint32_t output_polarity;                   /*!< the polarity and length of the pulse to be sent on the external synchronization outputs, refer to: the pulse on the synchronization output pad SHRTIMER_SCOUT */
}shrtimer_synccfg_parameter_struct;

/* bunch mode configuration struct definitions */
typedef struct {
    uint32_t mode;                              /*!< the bunch mode operating mode, refer to: continuous mode in bunch mode */
    uint32_t clock_source;                      /*!< specifies the burst mode clock source, refer to: bunch mode clock source*/
    uint32_t prescaler;                         /*!< the bunch mode prescaler, refer to: bunch mode clock division */
    uint32_t shadow;                            /*!< specifies whether or not preload is enabled for SHRTIMER_BMCMPV and SHRTIMER_BMCAR registers, refer to: bunch mode shadow enable */
    uint32_t trigger;                           /*!< the event triggering the bunch operation, refer to: the event triggers bunch mode operation */
    uint32_t idle_duration;                     /*!< the duration of the IDLE, 0x0000~0xFFFF  */
    uint32_t period;                            /*!< the bunch mode period which is the sum of the IDLE and RUN duration, 0x0001~0xFFFF  */
}shrtimer_bunchmode_parameter_struct;

/* external event configuration struct definitions */
typedef struct {
    uint32_t source;                            /*!< the source of the external event,refer to: external event source  */
    uint32_t polarity;                          /*!< the active level of external event 0 when EXEVyEG[1:0] = 2��b00, refer to: external event polarity */
    uint32_t edge ;                             /*!< the sensitivity of the external event, external event edge sensitivity */
    uint32_t digital_filter;                    /*!< external event filter control, 0x0~0xF */
}shrtimer_exeventcfg_parameter_struct;

/* fault input configuration struct definitions */
typedef struct {
    uint32_t source;                            /*!< the source of the fault input, refer to: fault input source */
    uint32_t polarity;                          /*!< the polarity of the fault input, refer to: fault input polarity */
    uint32_t filter;                            /*!< fault input filter control, 0x0~0xF */
    uint32_t control;                           /*!< fault input enable or disable, refer to: enable or disable fault */
    uint32_t protect ;                          /*!< protect fault input configuration, refer to: protect fault input configuration */
}shrtimer_faultcfg_parameter_struct;

/* ADC trigger configuration struct definitions */
typedef struct {
    uint32_t update_source;                     /*!< the source triggering the update of the SHRTIMER_ADCTRIGSy register, refer to: SHRTIMER_ADCTRIG update source */
    uint32_t trigger;                           /*!< the event triggering the ADC conversion, refer to:  ADC trigger event */
}shrtimer_adctrigcfg_parameter_struct;

/* channel output configuration struct definitions */
typedef struct {
    uint32_t polarity;                          /*!< configure channel output polarity, refer to: channel output polarity */
    uint32_t set_request;                       /*!< configure the event generates channel ��set request��, refer to channel set request */
    uint32_t reset_request;                     /*!< configure the event generates channel ��reset request��, refer to: channel reset request */
    uint32_t idle_bunch;                        /*!< specifies whether channel output can be IDLE state in bunch mode, refer to: channel IDLE state enable in bunch mode */
    uint32_t idle_state;                        /*!< specifies channel output idle state, refer to channel output idle state */
    uint32_t fault_state;                       /*!< specifies the output level when in FAULT state, refer to: channel output in fault state */
    uint32_t carrier_mode;                      /*!< specifies whether or not the carrier-signal mode is enabled, refer to: channel carrier-signal mode enable */
    uint32_t deadtime_bunch;                    /*!< specifies whether or not deadtime is inserted before output entering the IDLE state in bunch mode, refer to: channel dead-time insert in bunch mode */
}shrtimer_channel_outputcfg_parameter_struct;

/* SHRTIMER timer to configure */
#define SHRTIMER_SLAVE_TIMER0                            ((uint32_t)0x00000000U)                                 /*!< index associated to Slave_TIMER0 */
#define SHRTIMER_SLAVE_TIMER1                            ((uint32_t)0x00000001U)                                 /*!< index associated to Slave_TIMER1 */
#define SHRTIMER_SLAVE_TIMER2                            ((uint32_t)0x00000002U)                                 /*!< index associated to Slave_TIMER2 */
#define SHRTIMER_SLAVE_TIMER3                            ((uint32_t)0x00000003U)                                 /*!< index associated to Slave_TIMER3 */
#define SHRTIMER_SLAVE_TIMER4                            ((uint32_t)0x00000004U)                                 /*!< index associated to Slave_TIMER4 */
#define SHRTIMER_MASTER_TIMER                            ((uint32_t)0x00000005U)                                 /*!< index associated to Master_TIMER */
#define SHRTIMER_COMMONINDEX                             ((uint32_t)0x00000006U)                                 /*!< index associated to common registers */

