RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* compare unit to configure */
#define SHRTIMER_COMPARE0                                ((uint32_t)0x00000000U)                                 /*!< compare unit 0 */
#define SHRTIMER_COMPARE1                                ((uint32_t)0x00000001U)                                 /*!< compare unit 1 */
#define SHRTIMER_COMPARE2                                ((uint32_t)0x00000002U)                                 /*!< compare unit 2 */
#define SHRTIMER_COMPARE3                                ((uint32_t)0x00000003U)                                 /*!< compare unit 3 */
#define SHRTIMER_COMPARE0_COMPOSITE                      ((uint32_t)0x00000005U)                                 /*!< compare 0 composite unit */

/* capture unit to configure */
#define SHRTIMER_CAPTURE_0                               ((uint32_t)0x00000000U)                                 /*!< capture unit 0 */
#define SHRTIMER_CAPTURE_1                               ((uint32_t)0x00000001U)                                 /*!< capture unit 1 */

/* external event to configure */
#define SHRTIMER_EXEVENT_NONE                            ((uint32_t)0x00000000U)                                 /*!< undefined event channel */
#define SHRTIMER_EXEVENT_0                               ((uint32_t)0x00000001U)                                 /*!< extern event 0 */
#define SHRTIMER_EXEVENT_1                               ((uint32_t)0x00000002U)                                 /*!< extern event 1 */
#define SHRTIMER_EXEVENT_2                               ((uint32_t)0x00000004U)                                 /*!< extern event 2 */
#define SHRTIMER_EXEVENT_3                               ((uint32_t)0x00000008U)                                 /*!< extern event 3 */
#define SHRTIMER_EXEVENT_4                               ((uint32_t)0x00000010U)                                 /*!< extern event 4 */
#define SHRTIMER_EXEVENT_5                               ((uint32_t)0x00000020U)                                 /*!< extern event 5 */
#define SHRTIMER_EXEVENT_6                               ((uint32_t)0x00000040U)                                 /*!< extern event 6 */
#define SHRTIMER_EXEVENT_7                               ((uint32_t)0x00000080U)                                 /*!< extern event 7  */
#define SHRTIMER_EXEVENT_8                               ((uint32_t)0x00000100U)                                 /*!< extern event 8 */
#define SHRTIMER_EXEVENT_9                               ((uint32_t)0x00000200U)                                 /*!< extern event 9 */

/* fault to configure */
#define SHRTIMER_FAULT_0                                 ((uint32_t)0x00000000U)                                 /*!< fault 0 */
#define SHRTIMER_FAULT_1                                 ((uint32_t)0x00000001U)                                 /*!< fault 1 */
#define SHRTIMER_FAULT_2                                 ((uint32_t)0x00000002U)                                 /*!< fault 2 */
#define SHRTIMER_FAULT_3                                 ((uint32_t)0x00000004U)                                 /*!< fault 3 */
#define SHRTIMER_FAULT_4                                 ((uint32_t)0x00000008U)                                 /*!< fault 4 */

/* SHRTIMER_ADCTRIG to configure */
#define SHRTIMER_ADCTRIG_0                               ((uint32_t)0x00000000U)                                 /*!< SHRTIMER_ADCTRIG0 */
#define SHRTIMER_ADCTRIG_1                               ((uint32_t)0x00000001U)                                 /*!< SHRTIMER_ADCTRIG1 */
#define SHRTIMER_ADCTRIG_2                               ((uint32_t)0x00000002U)                                 /*!< SHRTIMER_ADCTRIG2 */
#define SHRTIMER_ADCTRIG_3                               ((uint32_t)0x00000003U)                                 /*!< SHRTIMER_ADCTRIG3 */

/* channel to configure */
#define SHRTIMER_ST0_CH0                                 ((uint32_t)0x00000001U)                                 /*!< Slave_TIMER0 channel 0 */
#define SHRTIMER_ST0_CH1                                 ((uint32_t)0x00000002U)                                 /*!< Slave_TIMER0 channel 1 */
#define SHRTIMER_ST1_CH0                                 ((uint32_t)0x00000004U)                                 /*!< Slave_TIMER1 channel 0 */
#define SHRTIMER_ST1_CH1                                 ((uint32_t)0x00000008U)                                 /*!< Slave_TIMER1 channel 1 */
#define SHRTIMER_ST2_CH0                                 ((uint32_t)0x00000010U)                                 /*!< Slave_TIMER2 channel 0 */
#define SHRTIMER_ST2_CH1                                 ((uint32_t)0x00000020U)                                 /*!< Slave_TIMER2 channel 1 */
#define SHRTIMER_ST3_CH0                                 ((uint32_t)0x00000040U)                                 /*!< Slave_TIMER3 channel 0 */
#define SHRTIMER_ST3_CH1                                 ((uint32_t)0x00000080U)                                 /*!< Slave_TIMER3 channel 1 */
#define SHRTIMER_ST4_CH0                                 ((uint32_t)0x00000100U)                                 /*!< Slave_TIMER4 channel 0 */
#define SHRTIMER_ST4_CH1                                 ((uint32_t)0x00000200U)                                 /*!< Slave_TIMER4 channel 1 */

/* the counter to enable/disable */
#define SHRTIMER_MT_COUNTER                              (SHRTIMER_MTCTL0_MTCEN)                                  /*!< the counter of Master_TIMER */
#define SHRTIMER_ST0_COUNTER                             (SHRTIMER_MTCTL0_ST0CEN)                                 /*!< the counter of Slave_TIMER0 */
#define SHRTIMER_ST1_COUNTER                             (SHRTIMER_MTCTL0_ST1CEN)                                 /*!< the counter of Slave_TIMER1 */
#define SHRTIMER_ST2_COUNTER                             (SHRTIMER_MTCTL0_ST2CEN)                                 /*!< the counter of Slave_TIMER2 */
#define SHRTIMER_ST3_COUNTER                             (SHRTIMER_MTCTL0_ST3CEN)                                 /*!< the counter of Slave_TIMER3 */
#define SHRTIMER_ST4_COUNTER                             (SHRTIMER_MTCTL0_ST4CEN)                                 /*!< the counter of Slave_TIMER4 */

/* counter clock division */
#define SHRTIMER_PRESCALER_MUL64                         ((uint32_t)0x00000008U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK = 64 *fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_MUL32                         ((uint32_t)0x00000000U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/2 = 32 *fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_MUL16                         ((uint32_t)0x00000001U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/4 = 16 *fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_MUL8                          ((uint32_t)0x00000002U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/8 = 8 *fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_MUL4                          ((uint32_t)0x00000003U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/16 = 4 *fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_MUL2                          ((uint32_t)0x00000004U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/32 = 2*fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_DIV1                          ((uint32_t)0x00000005U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/64 = fSHRTIMER_CK */
#define SHRTIMER_PRESCALER_DIV2                          ((uint32_t)0x00000006U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/128 = fSHRTIMER_CK/2 */
#define SHRTIMER_PRESCALER_DIV4                          ((uint32_t)0x00000007U)                                 /* fSHRTIMER_PSSCK = fHPTIM_HPCK/256 = fSHRTIMER_CK/4 */

/* counter operating mode */
#define SHRTIMER_COUNTER_MODE_CONTINOUS                  ((uint32_t)0x00000008U)                                 /*!< the timer operates in continuous (free-running) mode */
#define SHRTIMER_COUNTER_MODE_SINGLEPULSE                ((uint32_t)0x00000000U)                                 /*!< single pulse mode: the counter can be reset only if it stops (period elapsed) */
#define SHRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE  ((uint32_t)0x00000010U)                                 /*!< single pulse mode: the counter can be reset at any time (running or stopped) */

/* half mode enabling status */
#define SHRTIMER_HALFMODE_DISABLED                       ((uint32_t)0x00000000U)                                 /*!< half mode disable */
#define SHRTIMER_HALFMODE_ENABLED                        ((uint32_t)0x00000020U)                                 /*!< half mode enable */

