RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* synchronous input start timer */
#define SHRTIMER_SYNISTART_DISABLED                      ((uint32_t)0x00000000U)                                 /*!< the synchronous input signal cannot start the counter */
#define SHRTIMER_SYNISTART_ENABLED                       ((uint32_t)0x00000800U)                                 /*!< the synchronous input signal can start the counter */

/* synchronous input reset timer */
#define SHRTIMER_SYNCRESET_DISABLED                      ((uint32_t)0x00000000U)                                 /*!< the synchronous input signal cannot reset the counter */
#define SHRTIMER_SYNCRESET_ENABLED                       ((uint32_t)0x00000400U)                                 /*!< the synchronous input signal can reset the counter */

/* trigger source to DAC */
#define SHRTIMER_DAC_TRIGGER_NONE                        ((uint32_t)0x00000000U)                                 /*!< no DAC trigger event generated */
#define SHRTIMER_DAC_TRIGGER_DACTRIG0                    ((uint32_t)0x02000000U)                                 /*!< DAC trigger event generated on SHRTIMER_DACTRIG0 */
#define SHRTIMER_DAC_TRIGGER_DACTRIG1                    ((uint32_t)0x04000000U)                                 /*!< DAC trigger event generated on SHRTIMER_DACTRIG1 */
#define SHRTIMER_DAC_TRIGGER_DACTRIG2                    ((uint32_t)0x06000000U)                                 /*!< DAC trigger event generated on SHRTIMER_DACTRIG2 */

/* shadow registers enabling status */
#define SHRTIMER_SHADOW_DISABLED                         ((uint32_t)0x00000000U)                                 /*!< the shadow registers are disabled: the write access is directly done into the active registers */
#define SHRTIMER_SHADOW_ENABLED                          ((uint32_t)0x08000000U)                                 /*!< the shadow registers are enabled: the write access is done into the shadow registers */

/* update event selection */
#define SHRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT      ((uint32_t)0x00000000U)                                 /*!< update event generated independently from DMA mode */
#define SHRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE          ((uint32_t)0x10000000U)                                 /*!< update event generated when the DMA transfer completed in DMA mode */
#define SHRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE   ((uint32_t)0x20000000U)                                 /*!< update event generated on the update event following the DMA transfer completed in DMA mode */
#define SHRTIMER_ST_UPDATE_SELECTION_STXUPIN2            ((uint32_t)0x50000000U)                                 /*!< update event generated on the rising edge of STxUPIN2 */
#define SHRTIMER_ST_UPDATE_SELECTION_STXUPIN2_UPDATE     ((uint32_t)0x80000000U)                                 /*!< update event generated on the update event following the rising edge of STxUPIN2 */

/* timer behaves during a bunch mode operation */
#define SHRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK           ((uint32_t)0x00000000U)                                 /*!< counter clock(SHRTIMER_PSCCK) is maintained and the counter operates normally */
#define SHRTIMER_TIMERBUNCHMODE_RESETCOUNTER             ((uint32_t)0x00010000U)                                 /*!< counter clock(SHRTIMER_PSCCK) is stopped and the counter is reset */

/* update event generated by repetition event */
#define SHRTIMER_UPDATEONREPETITION_DISABLED             ((uint32_t)0x00000000U)                                 /*!< update event generated by repetition event disable */
#define SHRTIMER_UPDATEONREPETITION_ENABLED              ((uint32_t)0x20000000U)                                 /*!< update event generated by repetition event enable */

/* set balanced mode */
#define SHRTIMER_STXBALANCEDMODE_DISABLED                ((uint32_t)0x00000000U)                                 /*!< balanced mode disabled */
#define SHRTIMER_STXBALANCEDMODE_ENABLED                 ((uint32_t)0x00000040U)                                 /*!< balanced mode enabled */

/* faut channel enabled for a Slave_TIMER */
#define SHRTIMER_STXFAULTENABLE_NONE                     ((uint32_t)0x00000000U)                                 /*!< no fault enabled */
#define SHRTIMER_STXFAULTENABLE_FAULT0                   (SHRTIMER_STXFLTCTL_FLT0EN)                              /*!< fault 0 enabled */
#define SHRTIMER_STXFAULTENABLE_FAULT1                   (SHRTIMER_STXFLTCTL_FLT1EN)                              /*!< fault 1 enabled */
#define SHRTIMER_STXFAULTENABLE_FAULT2                   (SHRTIMER_STXFLTCTL_FLT2EN)                              /*!< fault 2 enabled */
#define SHRTIMER_STXFAULTENABLE_FAULT3                   (SHRTIMER_STXFLTCTL_FLT3EN)                              /*!< fault 3 enabled */
#define SHRTIMER_STXFAULTENABLE_FAULT4                   (SHRTIMER_STXFLTCTL_FLT4EN)                              /*!< fault 4 enabled */

/* protect fault enable */
#define SHRTIMER_STXFAULT_PROTECT_READWRITE              ((uint32_t)0x00000000U)                                 /*!< protect disable. FLTyEN (y=0..4) is writable */
#define SHRTIMER_STXFAULT_PROTECT_READONLY               (SHRTIMER_STXFLTCTL_FLTENPROT)                           /*!< protect enable. FLTyEN (y=0..4) is read-only */

/* dead time enable */
#define SHRTIMER_STXDEADTIME_DISABLED                    ((uint32_t)0x00000000U)                                 /*!< channel 0 and channel 1 outputs are independent. */
#define SHRTIMER_STXDEADTIME_ENABLED                     (SHRTIMER_STXCHOCTL_DTEN)                                /*!< channel 0 and channel 1 outputs are complementary and dead-time is inserted between channel 0 and channel 1 outputs */

/* set delayed IDLE state mode */
#define SHRTIMER_STXDELAYED_IDLE_DISABLED                ((uint32_t)0x00000000U)                                 /*!< no action */
#define SHRTIMER_STXDELAYED_IDLE_CH0_EEV57               (SHRTIMER_STXCHOCTL_DLYISMEN)                            /*!< channel 0 output delayed IDLE on external event 5 or 7 */
#define SHRTIMER_STXDELAYED_IDLE_CH1_EEV57               (((uint32_t)0x00000400U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< channel 1 output delayed IDLE on external event 5 or 7 */
#define SHRTIMER_STXDELAYED_IDLE_BOTH_EEV57              (((uint32_t)0x00000800U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< channel 0 and channel 1 output delayed IDLE on external event 5 or 7 */
#define SHRTIMER_STXDELAYED_IDLE_BALANCED_EEV57          (((uint32_t)0x00000C00U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< balanced IDLE on external event 5 or 7 */
#define SHRTIMER_STXDELAYED_IDLE_CH0_DEEV68              (((uint32_t)0x00001000U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< channel 0 output delayed IDLE on external event 6 or 8 */
#define SHRTIMER_STXDELAYED_IDLE_CH1_DEEV68              (((uint32_t)0x00001400U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< channel 1 output delayed IDLE on external event 6 or 8 */
#define SHRTIMER_STXDELAYED_IDLE_BOTH_EEV68              (((uint32_t)0x00001800U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< channel 0 and channel 1 output delayed IDLE on external event 6 or 8 */
#define SHRTIMER_STXDELAYED_IDLE_BALANCED_EEV68          (((uint32_t)0x00001C00U) | SHRTIMER_STXCHOCTL_DLYISMEN)  /*!< balanced IDLE on external event 6 or 8 */

/* update is done synchronously with any other Slave_TIMER or Master_TIMER update */
#define SHRTIMER_STXUPDATETRIGGER_NONE                   ((uint32_t)0x00000000U)                                 /*!< register update is disabled */
#define SHRTIMER_STXUPDATETRIGGER_MASTER                 (SHRTIMER_STXCTL0_UPBMT)                                 /*!< update by Master_TIMER update event */
#define SHRTIMER_STXUPDATETRIGGER_ST0                    (SHRTIMER_STXCTL0_UPBST0)                                /*!< update by Slave_TIMER0 update event */
#define SHRTIMER_STXUPDATETRIGGER_ST1                    (SHRTIMER_STXCTL0_UPBST1)                                /*!< update by Slave_TIMER1 update event */
#define SHRTIMER_STXUPDATETRIGGER_ST2                    (SHRTIMER_STXCTL0_UPBST2)                                /*!< update by Slave_TIMER2 update event */
#define SHRTIMER_STXUPDATETRIGGER_ST3                    (SHRTIMER_STXCTL0_UPBST3)                                /*!< update by Slave_TIMER3 update event */
#define SHRTIMER_STXUPDATETRIGGER_ST4                    (SHRTIMER_STXCTL0_UPBST4)                                /*!< update by Slave_TIMER4 update event */

/* Slave_TIMER counter reset */
#define SHRTIMER_STXCNT_RESET_NONE                       ((uint32_t)0x00000000U)                                 /*!< no counter reset trigger */
#define SHRTIMER_STXCNT_RESET_UPDATE                     (SHRTIMER_STXCNTRST_UPRST)                               /*!< the Slave_TIMER counter is reset upon update event */
#define SHRTIMER_STXCNT_RESET_CMP1                       (SHRTIMER_STXCNTRST_CMP1RST)                             /*!< the Slave_TIMER counter is reset upon Slave_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_CMP3                       (SHRTIMER_STXCNTRST_CMP3RST)                             /*!< the Slave_TIMER counter is reset upon Slave_TIMER compare 3 event */
#define SHRTIMER_STXCNT_RESET_MASTER_PER                 (SHRTIMER_STXCNTRST_MTPERRST)                            /*!< the Slave_TIMER counter is reset upon Master_TIMER period event */
#define SHRTIMER_STXCNT_RESET_MASTER_CMP0                (SHRTIMER_STXCNTRST_MTCMP0RST)                           /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 0 event */
#define SHRTIMER_STXCNT_RESET_MASTER_CMP1                (SHRTIMER_STXCNTRST_MTCMP1RST)                           /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_MASTER_CMP2                (SHRTIMER_STXCNTRST_MTCMP2RST)                           /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 2 event */
#define SHRTIMER_STXCNT_RESET_MASTER_CMP3                (SHRTIMER_STXCNTRST_MTCMP3RST)                           /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 3 event */
#define SHRTIMER_STXCNT_RESET_EEV_0                      (SHRTIMER_STXCNTRST_EXEV0RST)                            /*!< the Slave_TIMER counter is reset upon external event 0 */
#define SHRTIMER_STXCNT_RESET_EEV_1                      (SHRTIMER_STXCNTRST_EXEV1RST)                            /*!< the Slave_TIMER counter is reset upon external event 1 */
#define SHRTIMER_STXCNT_RESET_EEV_2                      (SHRTIMER_STXCNTRST_EXEV2RST)                            /*!< the Slave_TIMER counter is reset upon external event 2 */
#define SHRTIMER_STXCNT_RESET_EEV_3                      (SHRTIMER_STXCNTRST_EXEV3RST)                            /*!< the Slave_TIMER counter is reset upon external event 3 */
#define SHRTIMER_STXCNT_RESET_EEV_4                      (SHRTIMER_STXCNTRST_EXEV4RST)                            /*!< the Slave_TIMER counter is reset upon external event 4 */
#define SHRTIMER_STXCNT_RESET_EEV_5                      (SHRTIMER_STXCNTRST_EXEV5RST)                            /*!< the Slave_TIMER counter is reset upon external event 5 */
#define SHRTIMER_STXCNT_RESET_EEV_6                      (SHRTIMER_STXCNTRST_EXEV6RST)                            /*!< the Slave_TIMER counter is reset upon external event 6 */
#define SHRTIMER_STXCNT_RESET_EEV_7                      (SHRTIMER_STXCNTRST_EXEV7RST)                            /*!< the Slave_TIMER counter is reset upon external event 7 */
#define SHRTIMER_STXCNT_RESET_EEV_8                      (SHRTIMER_STXCNTRST_EXEV8RST)                            /*!< the Slave_TIMER counter is reset upon external event 8 */
#define SHRTIMER_STXCNT_RESET_EEV_9                      (SHRTIMER_STXCNTRST_EXEV9RST)                            /*!< the Slave_TIMER counter is reset upon external event 9 */
#define SHRTIMER_STXCNT_RESET_OTHER0_CMP0                BIT(19)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define SHRTIMER_STXCNT_RESET_OTHER0_CMP1                BIT(20)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_OTHER0_CMP3                BIT(21)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define SHRTIMER_STXCNT_RESET_OTHER1_CMP0                BIT(22)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define SHRTIMER_STXCNT_RESET_OTHER1_CMP1                BIT(23)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_OTHER1_CMP3                BIT(24)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define SHRTIMER_STXCNT_RESET_OTHER2_CMP0                BIT(25)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define SHRTIMER_STXCNT_RESET_OTHER2_CMP1                BIT(26)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_OTHER2_CMP3                BIT(27)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define SHRTIMER_STXCNT_RESET_OTHER3_CMP0                BIT(28)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define SHRTIMER_STXCNT_RESET_OTHER3_CMP1                BIT(29)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define SHRTIMER_STXCNT_RESET_OTHER3_CMP3                BIT(30)                                                 /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */

/* update event generated by reset event */
#define SHRTIMER_STXUPDATEONRESET_DISABLED               ((uint32_t)0x00000000U)                                 /*!< update event generated by reset event or roll-over event disable */
#define SHRTIMER_STXUPDATEONRESET_ENABLED                (SHRTIMER_STXCTL0_UPRST)                                 /*!< update event generated by reset event or roll-over event enable */

/* compare 3 or 1 delayed mode */
#define SHRTIMER_DELAYEDMODE_DISABLE                     ((uint32_t)0x00000000U)                                 /*!< delayed mode disable */
#define SHRTIMER_DELAYEDMODE_NOTIMEOUT                   ((uint32_t)0x00001000U)                                 /*!< compare event generated only if a capture has occurred */
#define SHRTIMER_DELAYEDMODE_TIMEOUTCMP0                 ((uint32_t)0x00002000U)                                 /*!< compare event generated if a capture has occurred or after a compare 0 match (timeout if capture event is missing) */
#define SHRTIMER_DELAYEDMODE_TIMEOUTCMP2                 ((uint32_t)0x00003000U)                                 /*!< compare event generated if a capture has occurred or after a compare 2 match (timeout if capture event is missing) */

/* capture trigger source */
#define SHRTIMER_CAPTURETRIGGER_NONE                     ((uint32_t)0x00000000U)                                 /*!< capture trigger is disabled */
#define SHRTIMER_CAPTURETRIGGER_UPDATE                   (SHRTIMER_STXCAP0TRG_CP0BUP)                             /*!< capture triggered by update event */
#define SHRTIMER_CAPTURETRIGGER_EXEV_0                   (SHRTIMER_STXCAP0TRG_CP0BEXEV0)                          /*!< capture triggered by external event 0 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_1                   (SHRTIMER_STXCAP0TRG_CP0BEXEV1)                          /*!< capture triggered by external event 1 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_2                   (SHRTIMER_STXCAP0TRG_CP0BEXEV2)                          /*!< capture triggered by external event 2 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_3                   (SHRTIMER_STXCAP0TRG_CP0BEXEV3)                          /*!< capture triggered by external event 3 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_4                   (SHRTIMER_STXCAP0TRG_CP0BEXEV4)                          /*!< capture triggered by external event 4 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_5                   (SHRTIMER_STXCAP0TRG_CP0BEXEV5)                          /*!< capture triggered by external event 5 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_6                   (SHRTIMER_STXCAP0TRG_CP0BEXEV6)                          /*!< capture triggered by external event 6 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_7                   (SHRTIMER_STXCAP0TRG_CP0BEXEV7)                          /*!< capture triggered by external event 7 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_8                   (SHRTIMER_STXCAP0TRG_CP0BEXEV8)                          /*!< capture triggered by external event 8 */
#define SHRTIMER_CAPTURETRIGGER_EXEV_9                   (SHRTIMER_STXCAP0TRG_CP0BEXEV9)                          /*!< capture triggered by external event 9 */
#define SHRTIMER_CAPTURETRIGGER_ST0_ACTIVE               (SHRTIMER_STXCAP0TRG_CP0BST0A)                           /*!< capture triggered by ST0CH0_O output inactive to active transition */
#define SHRTIMER_CAPTURETRIGGER_ST0_INACTIVE             (SHRTIMER_STXCAP0TRG_CP0BST0NA)                          /*!< capture triggered by ST0CH0_O output active to inactive transition */
#define SHRTIMER_CAPTURETRIGGER_ST0_CMP0                 (SHRTIMER_STXCAP0TRG_CP0BST0CMP0)                        /*!< capture triggered by compare 0 event of Slave_TIMER0 */
#define SHRTIMER_CAPTURETRIGGER_ST0_CMP1                 (SHRTIMER_STXCAP0TRG_CP0BST0CMP1)                        /*!< capture triggered by compare 0 event of Slave_TIMER0 */
#define SHRTIMER_CAPTURETRIGGER_ST1_ACTIVE               (SHRTIMER_STXCAP0TRG_CP0BST1A)                           /*!< capture triggered by ST1CH0_O output inactive to active transition */
#define SHRTIMER_CAPTURETRIGGER_ST1_INACTIVE             (SHRTIMER_STXCAP0TRG_CP0BST1NA)                          /*!< capture triggered by ST1CH0_O output active to inactive transition */
#define SHRTIMER_CAPTURETRIGGER_ST1_CMP0                 (SHRTIMER_STXCAP0TRG_CP0BST1CMP0)                        /*!< capture triggered by compare 0 event of Slave_TIMER1 */
#define SHRTIMER_CAPTURETRIGGER_ST1_CMP1                 (SHRTIMER_STXCAP0TRG_CP0BST1CMP1)                        /*!< capture triggered by compare 0 event of Slave_TIMER1 */
#define SHRTIMER_CAPTURETRIGGER_ST2_ACTIVE               (SHRTIMER_STXCAP0TRG_CP0BST2A)                           /*!< capture triggered by ST2CH0_O output inactive to active transition */
#define SHRTIMER_CAPTURETRIGGER_ST2_INACTIVE             (SHRTIMER_STXCAP0TRG_CP0BST2NA)                          /*!< capture triggered by ST2CH0_O output active to inactive transition */
#define SHRTIMER_CAPTURETRIGGER_ST2_CMP0                 (SHRTIMER_STXCAP0TRG_CP0BST2CMP0)                        /*!< capture triggered by compare 0 event of Slave_TIMER2 */
#define SHRTIMER_CAPTURETRIGGER_ST2_CMP1                 (SHRTIMER_STXCAP0TRG_CP0BST2CMP1)                        /*!< capture triggered by compare 0 event of Slave_TIMER2 */
#define SHRTIMER_CAPTURETRIGGER_ST3_ACTIVE               (SHRTIMER_STXCAP0TRG_CP0BST3A)                           /*!< capture triggered by ST3CH0_O output inactive to active transition */
#define SHRTIMER_CAPTURETRIGGER_ST3_INACTIVE             (SHRTIMER_STXCAP0TRG_CP0BST3NA)                          /*!< capture triggered by ST3CH0_O output active to inactive transition */
#define SHRTIMER_CAPTURETRIGGER_ST3_CMP0                 (SHRTIMER_STXCAP0TRG_CP0BST3CMP0)                        /*!< capture triggered by compare 0 event of Slave_TIMER3 */
#define SHRTIMER_CAPTURETRIGGER_ST3_CMP1                 (SHRTIMER_STXCAP0TRG_CP0BST3CMP1)                        /*!< capture triggered by compare 0 event of Slave_TIMER3 */
#define SHRTIMER_CAPTURETRIGGER_ST4_ACTIVE               (SHRTIMER_STXCAP0TRG_CP0BST4A)                           /*!< capture triggered by ST4CH0_O output inactive to active transition */
#define SHRTIMER_CAPTURETRIGGER_ST4_INACTIVE             (SHRTIMER_STXCAP0TRG_CP0BST4NA)                          /*!< capture triggered by ST4CH0_O output active to inactive transition */
#define SHRTIMER_CAPTURETRIGGER_ST4_CMP0                 (SHRTIMER_STXCAP0TRG_CP0BST4CMP0)                        /*!< capture triggered by compare 0 event of Slave_TIMER4 */
#define SHRTIMER_CAPTURETRIGGER_ST4_CMP1                 (SHRTIMER_STXCAP0TRG_CP0BST4CMP1)                        /*!< capture triggered by compare 0 event of Slave_TIMER4 */

