RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* dead time falling edge protection for value and sign */
#define SHRTIMER_DEADTIME_FALLING_PROTECT_DISABLE        ((uint32_t)0x00000000U)                                 /*!< protect disable. DTFS and DTFCFG[15:0] register are writable */
#define SHRTIMER_DEADTIME_FALLING_PROTECT_ENABLE         (SHRTIMER_STXDTCTL_DTFSVPROT)                            /*!< protect enable. DTFS and DTFCFG[15:0] are read-only */

/* dead time falling edge protection only for sign */
#define SHRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE    ((uint32_t)0x00000000U)                                 /*!< protect disable. DTFS bit is writable */
#define SHRTIMER_DEADTIME_FALLINGSIGN_PROTECT_ENABLE     (SHRTIMER_STXDTCTL_DTFSPROT)                             /*!< protect enable. DTFS bit is read-only */

/* the registers that can be written by DMA mode */
#define SHRTIMER_DMAMODE_NONE                            ((uint32_t)0x00000000U)                                 /*!< no register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CTL0                            (SHRTIMER_DMAUPSTXR_STXCTL0)                             /*!< MTCTL0 or STxCTL0 register is updated by DMA mode */
#define SHRTIMER_DMAMODE_INTC                            (SHRTIMER_DMAUPSTXR_STXINTC)                             /*!< MT or STx register is updated by DMA mode */
#define SHRTIMER_DMAMODE_DMAINTEN                        (SHRTIMER_DMAUPSTXR_STXDMAINTEN)                         /*!< MTINTC or STxINTC register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CNT                             (SHRTIMER_DMAUPSTXR_STXCNT)                              /*!< MTCNT or STxCNT register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CAR                             (SHRTIMER_DMAUPSTXR_STXCAR)                              /*!< MTCAR or STxCAR register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CREP                            (SHRTIMER_DMAUPSTXR_STXCREP)                             /*!< MTCREP or STxCREP register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CMP0V                           (SHRTIMER_DMAUPSTXR_STXCMP0V)                            /*!< MTCMP0V or STxCMP0V register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CMP1V                           (SHRTIMER_DMAUPSTXR_STXCMP1V)                            /*!< MTCMP1V or STxCMP1V register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CMP2V                           (SHRTIMER_DMAUPSTXR_STXCMP2V)                            /*!< MTCMP2V or STxCMP2V register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CMP3V                           (SHRTIMER_DMAUPSTXR_STXCMP3V)                            /*!< MTCMP3V or STxCMP3V register is updated by DMA mode */
#define SHRTIMER_DMAMODE_DTCTL                           (SHRTIMER_DMAUPSTXR_STXDTCTL)                            /*!< STxDTCTL register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CH0SET                          (SHRTIMER_DMAUPSTXR_STXCH0SET)                           /*!< STxCH0SET register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CH0RST                          (SHRTIMER_DMAUPSTXR_STXCH0RST)                           /*!< STxCH0RST register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CH1SET                          (SHRTIMER_DMAUPSTXR_STXCH1SET)                           /*!< STxCH1SET register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CH1RST                          (SHRTIMER_DMAUPSTXR_STXCH1RST)                           /*!< STxCH1RST register is updated by DMA mode */
#define SHRTIMER_DMAMODE_EXEVFCFG0                       (SHRTIMER_DMAUPSTXR_STXEXEVFCFG0)                        /*!< STxEXEVFCFG0 register is updated by DMA mode */
#define SHRTIMER_DMAMODE_EXEVFCFG1                       (SHRTIMER_DMAUPSTXR_STXEXEVFCFG1)                        /*!< STxEXEVFCFG1 register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CNTRST                          (SHRTIMER_DMAUPSTXR_STXCNTRST)                           /*!< STxCNTRST register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CSCTL                           (SHRTIMER_DMAUPSTXR_STXCSCTL)                            /*!< STxCSCTL register is updated by DMA mode */
#define SHRTIMER_DMAMODE_CHOCTL                          (SHRTIMER_DMAUPSTXR_STXCHOCTL)                           /*!< STxCHOCTL register is updated by DMA mode */
#define SHRTIMER_DMAMODE_FLTCTL                          (SHRTIMER_DMAUPSTXR_STXFLTCTL)                           /*!< STxFLTCTL register is updated by DMA mode */
#define SHRTIMER_DMAMODE_ACTL                            (SHRTIMER_DMAUPSTXR_STXACTL)                             /*!< STxACTL register is updated by DMA mode */

/* the synchronization input source */
#define SHRTIMER_SYNCINPUTSOURCE_DISABLE                 ((uint32_t)0x00000000U)                                 /*!< synchronization input disable */
#define SHRTIMER_SYNCINPUTSOURCE_INTERNAL                ((uint32_t)0x00000200U)                                 /*!< internal signal: TIMER0_TRGO in the advanced timer TIMER0 */
#define SHRTIMER_SYNCINPUTSOURCE_EXTERNAL                ((uint32_t)0x00000300U)                                 /*!< external signal: a positive pulse on the SHRTIMER_SCIN pin triggers the Master_TIMER */

/* the synchronization output source */
#define SHRTIMER_SYNCOUTPUTSOURCE_MTSTART                ((uint32_t)0x00000000U)                                 /*!< Master_TIMER start event to be sent to the synchronization output pad SHRTIMER_SCOUT */
#define SHRTIMER_SYNCOUTPUTSOURCE_MTCMP0                 ((uint32_t)0x00004000U)                                 /*!< Master_TIMER compare 0 event to be sent to the synchronization output pad SHRTIMER_SCOUT*/
#define SHRTIMER_SYNCOUTPUTSOURCE_ST0START               ((uint32_t)0x00008000U)                                 /*!< Slave_TIMER0 reset and start event to be sent to the synchronization output pad SHRTIMER_SCOUT */
#define SHRTIMER_SYNCOUTPUTSOURCE_ST0CMP0                ((uint32_t)0x0000C000U)                                 /*!< Slave_TIMER0 compare 0 event to be sent to the synchronization output pad SHRTIMER_SCOUT */

/* the pulse on the synchronization output pad SHRTIMER_SCOUT */
#define SHRTIMER_SYNCOUTPUTPOLARITY_DISABLE              ((uint32_t)0x00000000U)                                 /*!< pulse generated disable. No pulse on SHRTIMER_SCOUT */
#define SHRTIMER_SYNCOUTPUTPOLARITY_POSITIVE             ((uint32_t)0x00002000U)                                 /*!< positive pulse generated on the SHRTIMER_SCOUT. the length of it is 16 tSHRTIMER_CK cycles */
#define SHRTIMER_SYNCOUTPUTPOLARITY_NEGATIVE             ((uint32_t)0x00003000U)                                 /*!< negative pulse generated on the SHRTIMER_SCOUT. the length of it is 16 tSHRTIMER_CK cycles */

/* continuous mode in bunch mode */
#define SHRTIMER_BUNCHMODE_SINGLE                        ((uint32_t)0x00000000U)                                 /*!< single pulse mode. the BM-counter stops by hardware when it reaches the SHRTIMER_BMCAR value */
#define SHRTIMER_BUNCHMODE_CONTINOUS                     (SHRTIMER_BMCTL_BMCTN)                                   /*!< continuous mode. the BM-counter rolls over to zero and counts continuously when it reaches the SHRTIMER_BMCAR value */

/* bunch mode clock source */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_MASTER            ((uint32_t)0x00000000U)                                 /*!< the clock source for the bunch mode counter: Master_TIMER counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_ST0               ((uint32_t)0x00000004U)                                 /*!< the clock source for the bunch mode counter: Slave_TIMER0 counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_ST1               ((uint32_t)0x00000008U)                                 /*!< the clock source for the bunch mode counter: Slave_TIMER1 counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_ST2               ((uint32_t)0x0000000CU)                                 /*!< the clock source for the bunch mode counter: Slave_TIMER2 counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_ST3               ((uint32_t)0x00000010U)                                 /*!< the clock source for the bunch mode counter: Slave_TIMER3 counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_ST4               ((uint32_t)0x00000014U)                                 /*!< the clock source for the bunch mode counter: Slave_TIMER4 counter reset/roll-over event */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER6_TRGO       ((uint32_t)0x00000020U)                                 /*!< the clock source for the bunch mode counter: chip internal signal BMCLK2 */
#define SHRTIMER_BUNCHMODE_CLOCKSOURCE_SHRTIMERCK        ((uint32_t)0x00000028U)                                 /*!< the clock source for the bunch mode counter: prescaled fSHRTIMER_CK clock */

/* bunch mode clock division */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV1                ((uint32_t)0x00000000U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV2                ((uint32_t)0x00000040U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/2 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV4                ((uint32_t)0x00000080U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/4 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV8                ((uint32_t)0x000000C0U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/8 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV16               ((uint32_t)0x00000100U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/16 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV32               ((uint32_t)0x00000140U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/32 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV64               ((uint32_t)0x00000180U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/64 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV128              ((uint32_t)0x000001C0U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/128 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV256              ((uint32_t)0x00000200U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/256 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV512              ((uint32_t)0x00000240U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/512 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV1024             ((uint32_t)0x00000280U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/1024 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV2048             ((uint32_t)0x000002C0U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/2048*/
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV4096             ((uint32_t)0x00000300U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/4096 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV8192             ((uint32_t)0x00000340U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/8192 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV16384            ((uint32_t)0x00000380U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/16384 */
#define SHRTIMER_BUNCHMODE_PRESCALER_DIV32768            ((uint32_t)0x000003C0U)                                 /*!< fSHRTIMER_BMCNTCK = fSHRTIMER_CK/32768 */

/* bunch mode shadow enable */
#define SHRTIMER_BUNCHMODEPRELOAD_DISABLED               ((uint32_t)0x00000000U)                                 /*!< the shadow registers for SHRTIMER_BMCMPV and SHRTIMER_BMCAR registers are disabled */
#define SHRTIMER_BUNCHMODEPRELOAD_ENABLED                (SHRTIMER_BMCTL_BMSE)                                    /*!< the shadow registers for SHRTIMER_BMCMPV and SHRTIMER_BMCAR registers are enabled */

