RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* external event polarity */
#define SHRTIMER_EXEV_POLARITY_HIGH                      ((uint32_t)0x00000000U)                                 /*!< external event y active at high level */
#define SHRTIMER_EXEV_POLARITY_LOW                       (SHRTIMER_EXEVCFG0_EXEV0P)                               /*!< external event y active at low level */

/* external event edge sensitivity */
#define SHRTIMER_EXEV_EDGE_LEVEL                         ((uint32_t)0x00000000U)                                 /*!< level active. active level is defined by EXEVyP bit */
#define SHRTIMER_EXEV_EDGE_RISING                        ((uint32_t)0x00000008U)                                 /*!< rising edge active */
#define SHRTIMER_EXEV_EDGE_FALLING                       ((uint32_t)0x00000010U)                                 /*!< falling edge active */
#define SHRTIMER_EXEV_EDGE_BOTH                          ((uint32_t)0x00000018U)                                 /*!< both edges active */

/* external event digital filter clock division */
#define SHRTIMER_EXEV_PRESCALER_DIV1                     ((uint32_t)0x00000000U)                                 /*!< fSHRTIMER_EXEVFCK = fSHRTIMER_CK */
#define SHRTIMER_EXEV_PRESCALER_DIV2                     ((uint32_t)0x40000000U)                                 /*!< fSHRTIMER_EXEVFCK = fSHRTIMER_CK / 2 */
#define SHRTIMER_EXEV_PRESCALER_DIV4                     ((uint32_t)0x80000000U)                                 /*!< fSHRTIMER_EXEVFCK = fSHRTIMER_CK / 4 */
#define SHRTIMER_EXEV_PRESCALER_DIV8                     ((uint32_t)0xC0000000U)                                 /*!< fSHRTIMER_EXEVFCK = fSHRTIMER_CK / 8 */

/* fault input source */
#define SHRTIMER_FAULT_SOURCE_PIN                        ((uint32_t)0x00000000U)                                 /*!< the source of fault input is chip external pin */
#define SHRTIMER_FAULT_SOURCE_INTERNAL                   (SHRTIMER_FLTINCFG0_FLT0INSRC)                           /*!< the source of fault input is chip internal signal(for example comparator) */

/* fault input polarity */
#define SHRTIMER_FAULT_POLARITY_LOW                      ((uint32_t)0x00000000U)                                 /*!< fault 0 input active at low level */
#define SHRTIMER_FAULT_POLARITY_HIGH                     (SHRTIMER_FLTINCFG0_FLT0INP)                             /*!< fault 0 input active at high  level */

/* enable or disable fault */
#define SHRTIMER_FAULT_CHANNEL_DISABLE                   ((uint32_t)0x00000000U)                                 /*!< fault channel disable */
#define SHRTIMER_FAULT_CHANNEL_ENABLE                    (SHRTIMER_FLTINCFG0_FLT0INEN)                            /*!< fault channel enable */

/* protect fault input configuration */
#define SHRTIMER_FAULT_PROTECT_DISABLE                   ((uint32_t)0x00000000U)                                 /*!< protect disable. FLT0INEN, FLT0INP, FLT0INSRC and FLT0INFC[3:0] is writable */
#define SHRTIMER_FAULT_PROTECT_ENABLE                    (SHRTIMER_FLTINCFG0_FLT0INPROT)                          /*!< protect enable. FLT0INEN, FLT0INP, FLT0INSRC and FLT0INFC[3:0] is read-only */

/* fault input digital filter clock division */
#define SHRTIMER_FAULT_PRESCALER_DIV1                    ((uint32_t)0x00000000U)                                 /*!< fSHRTIMER_FLTFCK = fSHRTIMER_CK */
#define SHRTIMER_FAULT_PRESCALER_DIV2                    ((uint32_t)0x01000000U)                                 /*!< fSHRTIMER_FLTFCK = fSHRTIMER_CK/2 */
#define SHRTIMER_FAULT_PRESCALER_DIV4                    ((uint32_t)0x02000000U)                                 /*!< fSHRTIMER_FLTFCK = fSHRTIMER_CK/4 */
#define SHRTIMER_FAULT_PRESCALER_DIV8                    ((uint32_t)0x03000000U)                                 /*!< fSHRTIMER_FLTFCK = fSHRTIMER_CK/8 */

/* SHRTIMER_ADCTRIG update source */
#define SHRTIMER_ADCTRGI_UPDATE_MT                       ((uint32_t)0x00000000U)                                 /*!< Master_TIMER update event */
#define SHRTIMER_ADCTRGI_UPDATE_ST0                      ((uint32_t)0x00010000U)                                 /*!< Slaver_TIMER0 update event */
#define SHRTIMER_ADCTRGI_UPDATE_ST1                      ((uint32_t)0x00020000U)                                 /*!< Slaver_TIMER1 update event */
#define SHRTIMER_ADCTRGI_UPDATE_ST2                      ((uint32_t)0x00030000U)                                 /*!< Slaver_TIMER2 update event */
#define SHRTIMER_ADCTRGI_UPDATE_ST3                      ((uint32_t)0x00040000U)                                 /*!< Slaver_TIMER3 update event */
#define SHRTIMER_ADCTRGI_UPDATE_ST4                      ((uint32_t)0x00050000U)                                 /*!< Slaver_TIMER4 update event */

/*  ADC trigger event */
#define SHRTIMER_ADCTRGI02_EVENT_NONE                    ((uint32_t)0x00000000U)                                 /*!< no ADC trigger event */
#define SHRTIMER_ADCTRGI02_EVENT_MTCMP0                  (SHRTIMER_ADCTRIGS0_TRG0MTC0)                            /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Master_TIMER compare 0 */
#define SHRTIMER_ADCTRGI02_EVENT_MTCMP1                  (SHRTIMER_ADCTRIGS0_TRG0MTC1)                            /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Master_TIMER compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_MTCMP2                  (SHRTIMER_ADCTRIGS0_TRG0MTC2)                            /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Master_TIMER compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_MTCMP3                  (SHRTIMER_ADCTRIGS0_TRG0MTC3)                            /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Master_TIMER compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_MTPER                   (SHRTIMER_ADCTRIGS0_TRG0MTPER)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Master_TIMER period */
#define SHRTIMER_ADCTRGI02_EVENT_EXEV0                   (SHRTIMER_ADCTRIGS0_TRG0EXEV0)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on external event 0 */
#define SHRTIMER_ADCTRGI02_EVENT_EXEV1                   (SHRTIMER_ADCTRIGS0_TRG0EXEV1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on external event 1 */
#define SHRTIMER_ADCTRGI02_EVENT_EXEV2                   (SHRTIMER_ADCTRIGS0_TRG0EXEV2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on external event 2 */
#define SHRTIMER_ADCTRGI02_EVENT_EXEV3                   (SHRTIMER_ADCTRIGS0_TRG0EXEV3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on external event 3 */
#define SHRTIMER_ADCTRGI02_EVENT_EXEV4                   (SHRTIMER_ADCTRIGS0_TRG0EXEV4)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on external event 4 */
#define SHRTIMER_ADCTRGI02_EVENT_ST0CMP1                 (SHRTIMER_ADCTRIGS0_TRG0ST0C1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_ST0CMP2                 (SHRTIMER_ADCTRIGS0_TRG0ST0C2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_ST0CMP3                 (SHRTIMER_ADCTRIGS0_TRG0ST0C3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_ST0PER                  (SHRTIMER_ADCTRIGS0_TRG0ST0PER)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER0 period */
#define SHRTIMER_ADCTRGI02_EVENT_ST0RST                  (SHRTIMER_ADCTRIGS0_TRG0ST0RST)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER0 reset */
#define SHRTIMER_ADCTRGI02_EVENT_ST1CMP1                 (SHRTIMER_ADCTRIGS0_TRG0ST1C1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_ST1CMP2                 (SHRTIMER_ADCTRIGS0_TRG0ST1C2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_ST1CMP3                 (SHRTIMER_ADCTRIGS0_TRG0ST1C3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_ST1PER                  (SHRTIMER_ADCTRIGS0_TRG0ST1PER)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER1 period */
#define SHRTIMER_ADCTRGI02_EVENT_ST1RST                  (SHRTIMER_ADCTRIGS0_TRG0ST1RST)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER1 reset */
#define SHRTIMER_ADCTRGI02_EVENT_ST2CMP1                 (SHRTIMER_ADCTRIGS0_TRG0ST2C1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_ST2CMP2                 (SHRTIMER_ADCTRIGS0_TRG0ST2C2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_ST2CMP3                 (SHRTIMER_ADCTRIGS0_TRG0ST2C3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_ST2PER                  (SHRTIMER_ADCTRIGS0_TRG0ST2PER)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER2 period */
#define SHRTIMER_ADCTRGI02_EVENT_ST3CMP1                 (SHRTIMER_ADCTRIGS0_TRG0ST3C1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_ST3CMP2                 (SHRTIMER_ADCTRIGS0_TRG0ST3C2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_ST3CMP3                 (SHRTIMER_ADCTRIGS0_TRG0ST3C3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_ST3PER                  (SHRTIMER_ADCTRIGS0_TRG0ST3PER)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER3 period */
#define SHRTIMER_ADCTRGI02_EVENT_ST4CMP1                 (SHRTIMER_ADCTRIGS0_TRG0ST4C1)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 1 */
#define SHRTIMER_ADCTRGI02_EVENT_ST4CMP2                 (SHRTIMER_ADCTRIGS0_TRG0ST4C2)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 2 */
#define SHRTIMER_ADCTRGI02_EVENT_ST4CMP3                 (SHRTIMER_ADCTRIGS0_TRG0ST4C3)                           /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 3 */
#define SHRTIMER_ADCTRGI02_EVENT_ST4PER                  (SHRTIMER_ADCTRIGS0_TRG0ST4PER)                          /*!< SHRTIMER_ADCTRIG0 or SHRTIMER_ADCTRIG2 on Slave_TIMER4 period */

