RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
#define SHRTIMER_ADCTRGI13_EVENT_NONE                    ((uint32_t)0x00000000U)                                 /*!< no ADC trigger event */
#define SHRTIMER_ADCTRGI13_EVENT_MTCMP0                  (SHRTIMER_ADCTRIGS1_TRG1MTC0)                            /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Master_TIMER compare 0 */
#define SHRTIMER_ADCTRGI13_EVENT_MTCMP1                  (SHRTIMER_ADCTRIGS1_TRG1MTC1)                            /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Master_TIMER compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_MTCMP2                  (SHRTIMER_ADCTRIGS1_TRG1MTC2)                            /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Master_TIMER compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_MTCMP3                  (SHRTIMER_ADCTRIGS1_TRG1MTC3)                            /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Master_TIMER compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_MTPER                   (SHRTIMER_ADCTRIGS1_TRG1MTPER)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Master_TIMER period */
#define SHRTIMER_ADCTRGI13_EVENT_EXEV5                   (SHRTIMER_ADCTRIGS1_TRG1EXEV5)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on external event 5 */
#define SHRTIMER_ADCTRGI13_EVENT_EXEV6                   (SHRTIMER_ADCTRIGS1_TRG1EXEV6)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on external event 6 */
#define SHRTIMER_ADCTRGI13_EVENT_EXEV7                   (SHRTIMER_ADCTRIGS1_TRG1EXEV7)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on external event 7 */
#define SHRTIMER_ADCTRGI13_EVENT_EXEV8                   (SHRTIMER_ADCTRIGS1_TRG1EXEV8)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on external event 8 */
#define SHRTIMER_ADCTRGI13_EVENT_EXEV9                   (SHRTIMER_ADCTRIGS1_TRG1EXEV9)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on external event 9 */
#define SHRTIMER_ADCTRGI13_EVENT_ST0CMP1                 (SHRTIMER_ADCTRIGS1_TRG1ST0C1)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_ST0CMP2                 (SHRTIMER_ADCTRIGS1_TRG1ST0C2)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_ST0CMP3                 (SHRTIMER_ADCTRIGS1_TRG1ST0C3)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_ST0PER                  (SHRTIMER_ADCTRIGS1_TRG1ST0PER)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER0 period */
#define SHRTIMER_ADCTRGI13_EVENT_ST1CMP1                 (SHRTIMER_ADCTRIGS1_TRG1ST1C1)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_ST1CMP2                 (SHRTIMER_ADCTRIGS1_TRG1ST1C2)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_ST1CMP3                 (SHRTIMER_ADCTRIGS1_TRG1ST1C3)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_ST1PER                  (SHRTIMER_ADCTRIGS1_TRG1ST1PER)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER1 period */
#define SHRTIMER_ADCTRGI13_EVENT_ST2CMP1                 (SHRTIMER_ADCTRIGS1_TRG1ST2C1)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_ST2CMP2                 (SHRTIMER_ADCTRIGS1_TRG1ST2C2)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_ST2CMP3                 (SHRTIMER_ADCTRIGS1_TRG1ST2C3)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_ST2PER                  (SHRTIMER_ADCTRIGS1_TRG1ST2PER)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER2 period */
#define SHRTIMER_ADCTRGI13_EVENT_ST2RST                  (SHRTIMER_ADCTRIGS1_TRG1ST2RST)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER2 reset */
#define SHRTIMER_ADCTRGI13_EVENT_ST3CMP1                 (SHRTIMER_ADCTRIGS1_TRG1ST3C1)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_ST3CMP2                 (SHRTIMER_ADCTRIGS1_TRG1ST3C2)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_ST3CMP3                 (SHRTIMER_ADCTRIGS1_TRG1ST3C3)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_ST3PER                  (SHRTIMER_ADCTRIGS1_TRG1ST3PER)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER3 period */
#define SHRTIMER_ADCTRGI13_EVENT_ST3RST                  (SHRTIMER_ADCTRIGS1_TRG1ST3RST)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER3 reset */
#define SHRTIMER_ADCTRGI13_EVENT_ST4CMP1                 (SHRTIMER_ADCTRIGS1_TRG1ST4C1)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 1 */
#define SHRTIMER_ADCTRGI13_EVENT_ST4CMP2                 (SHRTIMER_ADCTRIGS1_TRG1ST4C2)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 2 */
#define SHRTIMER_ADCTRGI13_EVENT_ST4CMP3                 (SHRTIMER_ADCTRIGS1_TRG1ST4C3)                           /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 3 */
#define SHRTIMER_ADCTRGI13_EVENT_ST4RST                  (SHRTIMER_ADCTRIGS1_TRG1ST4RST)                          /*!< SHRTIMER_ADCTRIG1 or SHRTIMER_ADCTRIG3 on Slave_TIMER4 reset */

