RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_shrtimer.h
/* channel dead-time insert in bunch mode */
#define SHRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR             ((uint32_t)0x00000000U)                                 /*!< the output enter IDLE immediately */
#define SHRTIMER_CHANNEL_BUNCH_ENTRY_DEADTIME            ((uint32_t)0x00000080U)                                 /*!< dead-time is inserted before entering the IDLE state */

/* software event generates channel ��set request�� or ��reset request�� */
#define SHRTIMER_CHANNEL_SOFTWARE_SET                    ((uint32_t)0x00000001U)                                 /*!< software event cannot generate request */
#define SHRTIMER_CHANNEL_SOFTWARE_RESET                  ((uint32_t)0x00000002U)                                 /*!< software event can generate request */

/* channel output level */
#define SHRTIMER_CHANNEL_OUTPUT_ACTIVE                   ((uint32_t)0x00000001U)                                 /*!< channel outputs active level */
#define SHRTIMER_CHANNEL_OUTPUT_INACTIVE                 ((uint32_t)0x00000002U)                                 /*!< channel outputs inactive leve */

/* channel run state */
#define SHRTIMER_CHANNEL_STATE_IDLE                      ((uint32_t)0x00000001U)                                 /*!< Run state: the channel output can take the active or inactive level as programmed in the crossbar unit */
#define SHRTIMER_CHANNEL_STATE_RUN                       ((uint32_t)0x00000002U)                                 /*!< Idle state: after an SHRTIMER reset, when the outputs are disabled by software or during a bunch mode operation */
#define SHRTIMER_CHANNEL_STATE_FAULT                     ((uint32_t)0x00000003U)                                 /*!< Fault state: when a fault happen */

/* bunch mode operating flag */
#define SHRTIMER_BUNCHMODE_OPERATION_OFF                 ((uint32_t)0x00000000U)                                 /*!< normal operation. bunch mode is not operation */
#define SHRTIMER_BUNCHMODE_OPERATION_ON                  ((uint32_t)0x80000000U)                                 /*!< bunch mode operation on-going. */

/* function declarations */
/* SHRTIMER timebase configure functions */
/* deinit a SHRTIMER */
void shrtimer_deinit(uint32_t shrtimer_periph);
/* configure and start DLL calibration */
void shrtimer_dll_calibration_start(uint32_t shrtimer_periph, uint32_t calform);
/* initialize SHRTIMER SHRTIMER time base parameters struct with a default value */
void shrtimer_baseinit_struct_para_init(shrtimer_baseinit_parameter_struct* baseinit);
/* initialize Master_TIMER and Slave_TIMER timerbase */
void shrtimer_timers_base_init(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_baseinit_parameter_struct* baseinit);
/* enable a counter */
void shrtimer_timers_counter_enable(uint32_t shrtimer_periph, uint32_t cntid);
/* disable a counter */
void shrtimer_timers_counter_disable(uint32_t shrtimer_periph, uint32_t cntid);
/* enable the Master_TIMER or Slave_TIMER update event */
void shrtimer_timers_update_event_enable(uint32_t shrtimer_periph, uint32_t timer_id);
/* disable the Master_TIMER or Slave_TIMER update event */
void shrtimer_timers_update_event_disable(uint32_t shrtimer_periph, uint32_t timer_id);
/* trigger the Master_TIMER and Slave_TIMER registers update by software */
void shrtimer_software_update(uint32_t shrtimer_periph, uint32_t timersrc);
/* reset the Master_TIMER and Slave_TIMER counter by software */
void shrtimer_software_counter_reset(uint32_t shrtimer_periph, uint32_t timerrst);

/* SHRTIMER waveform configure functions */
/* initialize waveform mode initialization parameters struct with a default value */
void shrtimer_timerinit_struct_para_init(shrtimer_timerinit_parameter_struct* timerinit);
/* initialize a timer to work in waveform mode */
void shrtimer_timers_waveform_init(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_timerinit_parameter_struct* timerinitpara);
/* initialize Slave_TIMER general behavior configuration struct with a default value */
void shrtimer_timercfg_struct_para_init(shrtimer_timercfg_parameter_struct* timercgf);
/* configure the general behavior of a Slave_TIMER which work in waveform mode */
void shrtimer_slavetimer_waveform_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_timercfg_parameter_struct * timercfg);
/* initialize compare unit configuration struct with a default value */
void shrtimer_comparecfg_struct_para_init(shrtimer_comparecfg_parameter_struct* comparecfg);
/* configure the compare unit of a Slave_TIMER which work in waveform mode */
void shrtimer_slavetimer_waveform_compare_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t comparex, shrtimer_comparecfg_parameter_struct* cmpcfg);
/* initialize channel output configuration struct  with a default value */
void shrtimer_channel_outputcfg_struct_para_init(shrtimer_channel_outputcfg_parameter_struct * channelcfg);
/* configure the channel output of a Slave_TIMER work in waveform mode */
void shrtimer_slavetimer_waveform_channel_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t channel, shrtimer_channel_outputcfg_parameter_struct * channelcfg);
/* software generates channel "set request" or "reset request" */
void shrtimer_slavetimer_waveform_channel_software_request(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t channel, uint32_t request);
/* get Slave_TIMER channel output level */
uint32_t shrtimer_slavetimer_waveform_channel_output_level_get(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t channel);
/* get Slave_TIMER channel run state */
uint32_t shrtimer_slavetimer_waveform_channel_state_get(uint32_t shrtimer_periph, uint32_t channel);
/* initialize dead time configuration struct with a default value */
void shrtimer_deadtimercfg_struct_para_init(shrtimer_deadtimecfg_parameter_struct * dtcfg);
/* configure the dead time for Slave_TIMER */
void shrtimer_slavetimer_deadtime_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_deadtimecfg_parameter_struct* dtcfg);
/* initialize carrier signal configuration struct with a default value */
void shrtimer_carriersignalcfg_struct_para_init(shrtimer_carriersignalcfg_parameter_struct* carriercfg);
/* configure the carrier signal mode for Slave_TIMER */
void shrtimer_slavetimer_carriersignal_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_carriersignalcfg_parameter_struct* carriercfg);
/* enable a output channel */
void shrtimer_output_channel_enable(uint32_t shrtimer_periph, uint32_t chid);
/* disable a output channel */
void shrtimer_output_channel_disable(uint32_t shrtimer_periph, uint32_t chid);

/* Master_TIMER and Slave_TIMER numerical related functions */
/* configure the compare value in Master_TIMER */
void shrtimer_mastertimer_compare_value_config(uint32_t shrtimer_periph, uint32_t comparex, uint32_t cmpvalue);
/* get the compare value in Master_TIMER */
uint32_t shrtimer_mastertimer_compare_value_get(uint32_t shrtimer_periph, uint32_t comparex);
/* configure the compare value in Slave_TIMER */
void shrtimer_slavetimer_compare_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t comparex, uint32_t cmpvalue);
/* get the compare value in Slave_TIMER */
uint32_t shrtimer_slavetimer_compare_value_get(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t comparex);
/* configure the counter value in Master_TIMER and Slave_TIMER */
void shrtimer_timers_counter_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t cntvalue);
/* get the counter value in Master_TIMER and Slave_TIMER */
uint32_t shrtimer_timers_counter_value_get(uint32_t shrtimer_periph, uint32_t timer_id);
/* configure the counter auto reload value in Master_TIMER and Slave_TIMER */
void shrtimer_timers_autoreload_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t carlvalue);
/* get the counter auto reload value in Master_TIMER and Slave_TIMER */
uint32_t shrtimer_timers_autoreload_value_get(uint32_t shrtimer_periph, uint32_t timer_id);
/* configure the counter repetition value in Master_TIMER and Slave_TIMER */
void shrtimer_timers_repetition_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t replvalue);
/* get the counter repetition value in Master_TIMER and Slave_TIMER */
uint32_t shrtimer_timers_repetition_value_get(uint32_t shrtimer_periph, uint32_t timer_id);

/* external event and synchronization configure functions */
/* initialize external event filtering for Slave_TIMER configuration struct with a default value */
void shrtimer_exevfilter_struct_para_init(shrtimer_exevfilter_parameter_struct * exevfilter);
/* configure the external event filtering for Slave_TIMER (blanking, windowing) */
void shrtimer_slavetimer_exevent_filtering_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t event_id, shrtimer_exevfilter_parameter_struct* exevfilter);
/* initialize external event configuration struct with a default value */
void shrtimer_exeventcfg_struct_para_init(shrtimer_exeventcfg_parameter_struct * exevcfg);
/* configure the an external event */
void shrtimer_exevent_config(uint32_t shrtimer_periph, uint32_t event_id, shrtimer_exeventcfg_parameter_struct* exevcfg);
/* configure external event digital filter clock division */
void shrtimer_exevent_prescaler(uint32_t shrtimer_periph, uint32_t prescaler);
/* initialize synchronization configuration struct with a default value */
void shrtimer_synccfg_struct_para_init(shrtimer_synccfg_parameter_struct* synccfg);
/* configure the synchronization input/output of the SHRTIMER */
void shrtimer_synchronization_config(uint32_t shrtimer_periph, shrtimer_synccfg_parameter_struct* synccfg);

/* fault configure functions */
/* configure the synchronization input/output of the SHRTIMER */
void shrtimer_faultcfg_struct_para_init(shrtimer_faultcfg_parameter_struct * faultcfg);
/* configure the fault input */
void shrtimer_fault_config(uint32_t shrtimer_periph, uint32_t fault_id, shrtimer_faultcfg_parameter_struct* faultcfg);
/* configure the fault input digital filter clock division */
void shrtimer_fault_prescaler_config(uint32_t shrtimer_periph, uint32_t prescaler);
/* fault input enable */
void shrtimer_fault_input_enable(uint32_t shrtimer_periph, uint32_t fault_id);
/* fault input disable */
void shrtimer_fault_input_disable(uint32_t shrtimer_periph, uint32_t fault_id);

